<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.lib-pub-firefox</string>
	<key>Input</key>
	<dict>
		<key>LOCALE</key>
		<string>en_US</string>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>bin/mozilla</string>
		<key>NAME</key>
		<string>lib-pub-firefox</string>
		<key>RELEASE</key>
		<string>latest-esr</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Mozilla Firefox is a free and open source web browser.</string>
			<key>display_name</key>
			<string>Mozilla Firefox</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>edu.fsu.lib.munki.firefox.pub</string>
</dict>
</plist>
