<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Firefox disk image and builds a package.
            Values for RELEASE correspond to directories here: http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
            Some useful values are: 'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
            LOCALE corresponds to directories at http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$RELEASE/mac/
            Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
            No idea if all Firefox builds are available in all the same localizations, so you may need to verify that any particular
            combination is offered.</string>
        <key>Identifier</key>
        <string>edu.fsu.lib.pkg.firefox.pub</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Firefox</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.firefox-rc-en_US</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AppDmgVersioner</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Firefox.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/Firefox.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Merger</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>/Users/libadmin/software-packaging/lib-pub-firefox/cck-output/firefox</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/Firefox.app/Contents/MacOS/</string>
                    <key>overwrite</key>
                    <string>true</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>id</key>
                        <string>org.mozilla.firefox.pkg</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgSigner</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>signing_cert</key>
                    <string>3rd Party Mac Developer Installer: Walter Shackelford (Y8LMAY4MPD)</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
