<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Assembles the customization package for the libraries' deployment of Google Chrome, 
    signs it, and imports it into munki.</string>
    <key>Identifier</key>
    <string>edu.fsu.lib.chromemasterprefs.munki.recipe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>lib-all-chromemasterprefs</string>
        <key>SOURCE_PATH</key>
        <string>/Users/libadmin/software-packaging/lib-all-chrome/lib-all-chromemasterprefs/pkgroot/Library/Google</string>
        <key>SCRIPT_PATH</key>
        <string>/Users/libadmin/software-packaging/lib-all-chrome/lib-all-chromemasterprefs/pkgscripts</string>
        <key>VERSION</key>
        <string>1.0</string>
        <key>ID</key>
        <string>edu.fsu.lib.chromemasterprefs</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>bin/google</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>This package customizes the libraries' deployment of the Google Chrome web browser.</string>
            <key>display_name</key>
            <string>Chrome Customizations</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>requires</key>
            <string>lib-all-chrome</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0775</string>
                    <key>Library/Google</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Merger</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%SOURCE_PATH%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/Google</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                    <key>id</key>
                    <string>%ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>%SCRIPT_PATH%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library/Google</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
