<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Vox and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.fsu-autopkg-recipes.munki.Vox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Vox</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>bin/Vox</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://updates.devmate.com/com.coppertino.Vox.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Media</string>
            <key>description</key>
            <string>VOX is a minimal music player that handles iTunes libraries, Soundcloud playlists, and random audio files.</string>
            <key>display_name</key>
            <string>Vox</string>
            <key>developer</key>
            <string>Coppertino Inc.</string>
            <key>icon_name</key>
            <string>Vox.png</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>installer_type</key>
            <string>copy_from_dmg</string>
            <key>items_to_copy</key>
            <array>
                <dict>
                    <key>destination_path</key>
                    <string>/Applications</key>
                    <key>source_item</key>
                    <string>Vox.app</string>
                </dict>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
	<string>com.github.fsu-autopkg-recipes.download.Vox</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
